In [10]:
import numpy as np
from pandas import read_csv

data = read_csv('../R/mad_sample.csv')
data.columns = data.columns.str.replace(".", "_")
data.head()

   X_1  X_2  X_3  Y
0  485  477  537  0
1  483  458  460  0
2  487  542  499  0
3  480  491  510  1
4  484  502  528  1

In [11]:
X = np.array(data[['X_1','X_2','X_3']])
Y = np.array(data.Y)
X[:3,:], Y[:3]

(array([[485, 477, 537],
        [483, 458, 460],
        [487, 542, 499]], dtype=int64), array([0, 0, 0], dtype=int64))

In [15]:
IG = read_csv('../R/mad_sample_IG.csv')
IG.head()

          IG  Tuple.1  Tuple.2
0  13.222755        1        3
1  12.462540        1        2
2   8.535545        1        3